Repository: openatv/enigma2-plugin-extensions-dflash
Catalog: usr/lib/enigma2/python/Plugins/Extensions/dFlash/locale/*/LC_MESSAGES/dflash.po
Languages: fa, it, pl

source: yes
it: Si
pl: Tak

source: recovery
it: ripristino

source: favor_lzo
it: favorire lzo

source: Select nfi image for flashing
fa: ايميج ان‌اف‌آي را براي فلش انتخاب كنيد
it: Selezionare l'immagine .nfi da installare
pl: Wybierz Image .nfi do Flashowania

source: Disclaimer
fa: رفع ادعا
it: AVVISO
pl: CZYTAJ !

source: This way of flashing your Dreambox is potentially dangerous and not supported in any way from DMM. You are using it completely at you own risk! If you want to flash your Dreambox safely use the Webinterface or DreamUP! May the Null modem cable be with you!
fa: اين نوع فلش كردن دريمباكس بطور بالقوه ميتواند خطرناك باشد و توسط شركت مذكور حمايت نميشود !خطر استفاده از اين پلاگين را خود مي پذيريد اگر ميخواهيد دريمباكس را بطور ايمن فلش كنيد از دريم‌آپ يا واسط وب استفاده كنيد !بايد كابل آپگريد را بهمراه داشته باشيد
it: Questo modo di installare il software nel Dreambox potrebbe essere rischioso e in ogni caso non supportato da DMM's. L'uso di dFlash è esclusivamente a vostro rischio! Per flashare, usare DreamUP o la Interfaccia Web! Tenere a portata di mano un cavo Nullmodem!
pl: Ten sposób Flash`owania Dreamboxa jest potencjalnie niebezpieczny i w żaden sposób nie jest wspierany przez DMM. Używasz tej metody całkowicie na własne ryzyko! Jeśli chcesz bezpiecznie flash`ować Dreamboxa rób to przez przeglądarkę WWW lub DreamUP`em! P.S Miej przy sobie zawsze kabel Null Modem!

source: direct Flash Plugin by gutemine Version %s
it: versione dFlash %s by gutemine Meglio lontano con qualcuno, che da nessuna parte con tutti. /blu8/
pl: Wtyczka dFlash od gutemine Wersja %s tłumaczenie kosmacz

source: %i MB Swapspace OK
it: %i MB Swap OK
pl: %i MB przestrzeń dla pliku Swap OK

source: Flashing
fa: در حال فلش
it: Flash
pl: Flash

source: Configuring
it: Impostazioni
pl: Ustawienia

source: Checking
it: Controllo
pl: Kontrola

source: dFlash is busy ...
it: dFlash occupato...

source: Enter Backup Imagename
fa: نام ايميج پشتيبان را وارد كنيد
it: Inserire il nome del Backup
pl: Wpisz nazwę Image dla Backup`u

source: Enter Backup Path
fa: مسير پشتيبان را وارد كنيد
it: Inserire la destinazione del Backup
pl: Wpisz ścieżkę dla Backup`u

source: Sorry, currently not supported on this Dreambox type
it: Non supportato per questo Dreambox
pl: Niestety, obecnie nie jest obsługiwana w tego typu Dreambox`ach

source: Sorry, no correct nfi file selected
fa: متاسفيم فايل ان‌اف‌آي اشتباهي انتخاب شده است
it: Selezionato un file .nfi non adeguato
pl: Niestety, wybrano niepoprawny plik nfi

source: Sorry, no nfi file unzipped
it: nessun file .nfi dezippato

source: Sorry, bad blocks in %s Flash, better try DreamUP with recover bad sectors
it: bad blocks in %s Flash, usare DreamUP con opzione recover bad sectors
pl: Uwaga, uszkodzone Bloki w %s Flash, lepiej spróbuj DreamUP`a z funkcją odzyskania uszkodzonych sektorów

source: Refresh
fa: به‌روزآوري
it: Aggiornare
pl: Odśwież

source: Nothing mounted at %s
fa: نصب نشده است %s چيزي در
it: Nessun mount su %s
pl: Niczego nie podmontowano w %s

source: Sorry, use Barry Allen for Backup
it: Usare Barry Allen per il Backup
pl: Użyj Barry Allen do wykonania Backup`u

source: Sorry, use LowFAT for Backup
it: Usare LowFAT per il Backup
pl: Użyj LowFat do wykonania Backup`u

source: Sorry, use Dumbo for Backup
it: Usare Dumbo per il Backup
pl: Użyj Dumbo do wykonania Backup`u

source: use back button in browser and try again!
fa: !دكمه بازگشت مرورگر را زده و مجددا تلاش كنيد
it: Usare il tasto indietro sul browser e riprovare!
pl: Użyj przycisku Wstecz w przeglądarce i spróbuj ponownie!

source: Cancel
fa: لغو
it: Annullare
pl: Anuluj

source: Are you sure that you want to unzip %s ?
it: decomprimere %s?

source: Sorry, unzip of %s was canceled!
it: decompressione di %s cancellata!

source: choose rambo device
it: selezionare il supporto rambo
pl: Wybierz urządzenie magazynujące Rambo

source: choose flodder device
it: selezionare il supporto flodder

source: choose recovery device
it: selezionare il supporto ripristino

source: choose raw device
it: selezionare il supporto raw

source: Are you sure that you want to flash now %s ?
fa: %s مطمئنيدكه حالا ميخواهيد فلش كنيد؟
it: Installare l'immagine: %s ?
pl: Czy na pewno chcesz teraz flashować %s ?

source: Sorry, Flashing of %s was canceled!
fa: !لغو شد %s متاسفانه فلش
it: Installazione di "%s "annullata!
pl: Flashowanie %s zostało anulowane!

source: Press OK now for flashing %s Box will reboot automatically when finished!
it: Premere OK per installare: %s a operazione conclusa il box si riavvierà automaticamente !
pl: Naciśnij przycisk OK aby flashować %s Tuner automatycznie uruchomi się ponownie po zakończeniu!

source: Sorry, no device choosen
it: Nessun supporto selezionato
pl: Niestety, nie wybrano urządzenia

source: Sorry, no device found
it: Nessun supporto trovato
pl: Niestety, nie znaleziono urządzenia

source: Are you sure that you want to FORMAT recovery device %s now for %s ?
it: Formattare ora il supporto %s per installare %s ?

source: Sorry, %s device not mounted
it: Supporto %s non montato
pl: %s urządzenie nie jest podmountowane

source: Copied %s.nfi to %s, don't forget kernel commandline and now reboot for activating it ?
it: %s.nfi copiata in %s, non dimenticate la linea di comando del kernel riavviare per attivarla ?

source: Copied %s.nfi to %s, don't forget to remove stick if you enabled kernel commandline! Halt now ?
it: %s.nfi copiata in %s, rimuovere adesso la pennetta usb se è stata abilitata la linea di comando kernel! Arrestare adesso ?

source: Copied %s.nfi to %s, reboot for activating it ?
it: %s.nfi copiata in %s, riavviare per attivarla?
pl: Kopiowanie %s nfi do %s, Uruchomić ponownie, aby aktywować?

source: Flash Backup to %s finished with imagename: %s.nfi BUT it has I/O Errors
it: Flash Backup in %s eseguito con nome: %s.nfi MA CON ERRORE I/O

source: Flash Backup to %s finished with imagename: %s.nfi
fa: :انجام شد با نام زير %s پشتيبان گيري از فلش %s.nfi
it: Flash Backup in %s eseguito con nome: %s .nfi
pl: wykonano Backup z Flash do: %s pod nazwą Image: %s.nfi

source: nothing entered
fa: چيزي وارد نشد
it: Nessun inserimento
pl: Nic nie wprowadzono

source: already exists,
fa: قبلا وجود دارد,
it: già esistente,
pl: już istnieje,

source: overwrite ?
fa: رونويسي؟
it: sovrascrivere ?
pl: Nadpisać ?

source: Using temporary swapspace.
fa: .در حال استفاده از فضاي موقتي انتقال
it: Uso temporaneo del file swap
pl: Wykorzystanie tymczasowej przestrzeni wymiany Swap.

source: Enigma2 will restart due to lack of swapspace, check result with Backup in Plugin afterwards.
fa: بدليل فقدان فضاي انتقال انيگما2 ري استارت ميكند . سپس نتيجه را در قسمت پشتيباني در منوي پلاگين بررسي نماييد
it: Enigma2 per mancanza di Swap verrà arrestata; si riavvierà a completamento terminato del backup. controllare l'esito in Plugin con la funzione strumenti per backup
pl: Enigma2 zostanie ponownie uruchomiona z powodu braku przestrzeni wymiany Swap, Sprawdź potem wynik z Backup`u we wtyczce.

source: Without swapspace.
it: Senza Swap.
pl: Bez pliku wymiany Swap

source: Using existing swapspace.
fa: .درحال استفاده از فضاي انتقال موجود
it: Utilizzo lo Swap presente
pl: Wykorzystanie istniejącej przestrzeni wymiany Swap.

source: Press OK for starting backup to
it: Premere OK per avviare il backup
pl: Naciśnij przycisk OK ,aby rozpocząć tworzenie Backup`u

source: Be patient, this takes 5-10min ...
it: previsti da 5 a 10 min. Attendere...
pl: Cierpliwości, to zajmie kilka minut ...

source: not confirmed
fa: تاييد نشده
it: Non confermato
pl: nie potwierdzone

source: About
fa: در مورد
it: Info su
pl: O wtyczce

source: check /dev/mtd0 = entire Flash
it: Test/dev/mtd0 = Flash intera
pl: check /dev/mtd0 = cały Flash

source: check /dev/mtd/0 = entire Flash
it: Test /dev/mtd/0 = Flash intera
pl: check /dev/mtd/0 = cały Flash

source: check /dev/mtd1 = secondstage loader
it: Test /dev/mtd1 = secondstage loader

source: check /dev/mtd/1 = secondstage loader
it: Test /dev/mtd1 = secondstage loader

source: check /dev/mtd2 = boot
it: Test /dev/mtd2 = boot

source: check /dev/mtd/2 = boot
it: Test /dev/mtd/2 = boot

source: check /dev/mtd3 = root
it: Test /dev/mtd3 = root

source: check /dev/mtd/3 = root
it: Test /dev/mtd/3 = root

source: check /dev/mtd4 = home
it: Test /dev/mtd4 = home

source: check /dev/mtd/4 = home
it: Test /dev/mtd/4 = home

source: check /dev/mtd5 = unused
it: Test /dev/mtd5 = non usato
pl: check /dev/mtd5 = nie używany

source: check /dev/mtd/5 = unused
it: Test /dev/mtd/5 = non usato
pl: check /dev/mtd/5 = nie używany

source: check /dev/mtd6 = unused
it: Test /dev/mtd6 = non usato
pl: check /dev/mtd6 = nie używany

source: check /dev/mtd/6 = unused
it: Test /dev/mtd/6 = non usato
pl: check /dev/mtd/6 = nie używany

source: checking %s - be patient (up to 1 min)
it: Test %s - attendere (> 1 min.)
pl: sprawdzanie %s (około 1 min)

source: B Bad block . Empty block - Partially filled block = Full block, no summary node S Full block, summary node Ignore B at the end of Flash
it: B Blocco danneggiato . Blocco vuoto - Blocco scritto solo in parte = Blocco completo, nessun nodo S Blocco completo, nodo Ignorare B alla fine della Flash
pl: Oznaczenia: B Wadliwy Blok . Pusty Blok - Częściowo wypełniony blok = Pełny Blok, brak podsumowania węzła S Pełny Blok, podsumowany węzeł Ignoruj oznaczenia B na końcu Flasha

source: Flashtool
it: Strumenti per flash
pl: Narzędzie dla Flash

source: Backuptool
it: Strumenti per backup
pl: Narzędzie dla Backup`u

source: jffs2 boot compression
it: jffs2 compressione boot

source: jffs2 root compression
it: jffs2 compressione root

source: jffs2 erase block summary
it: jffs2 cancellazione blocco
pl: Wymazać podsumowanie bloku jffs2

source: ubifs root compression
it: ubifs compressione root
pl: Kompresja Root ubifs

source: ubifs data backup
it: ubifs backup data

source: ubifs data compression
it: ubifs compressione data

source: ubifs debug level
it: ubifs livello debug

source: Console output
it: Output su Consolle
pl: Konsola

source: loop swap over network
it: ciclo di swap su rete
pl: Powiązać plik wymiany Swap przez sieć

source: include /usr mount in backup
it: includere /usr mount nel Backup
pl: Uwzględnić katalog /usr w Backup`ie

source: include squashfs directories in backup
it: includere la cartella squashfs nel Backup
pl: Uwzględnić katalogi squashfs w Backup`ie

source: zip backups
it: backups zip

source: show in Extensions Menu
it: Visualizza in estensioni Menu
pl: Pokaż w menu Rozszerzenia

source: Root Filesystem total: %s MB used: %s MB free: %s MB
it: Root Filesystem totale: %s MB usato: %s MB libero: %s MB

source: Memory total: %i MB used: %i MB free: %i MB
it: Memoria totale: %i MB usato: %i MB libero: %i MB
pl: Pamięć łącznie: %i MB użyta: %i MB wolna: %i MB

source: Backup is running...
fa: ...در حال پشتيبان‌گيري
pl: Trwa wykonywanie Backup`u...

source: Root Filesystem total: %s MB used: %s MB free: %s
pl: Root łącznie: %s MB użyta: %s MB wolna: %s

source: Swapsize [MB]
pl: Rozmiar pliku wymiany Swap [w MB]

source: jffs2 compression
pl: Kompresja jffs2

source: keep temporary files
pl: Zachować pliki tymczasowe z /tmp

source: no
pl: Nie

source: none
pl: żaden

source: Root Volume Size [40-59MB]
pl: Rozmiar w Root [40-59MB]

source: sort alphabetic
pl: Sortuj alfabetycznie

source: use ramfs for flashing
pl: Flash z wykorzystaniem ramfs

source: Sorry, no /lib/libc-2.10.2.so - Image maybe too old
fa: ايميچج خيلي قديمي است- /lib/libc-2.10.2.so متاسفيم-بدون

source: Sorry, nfi file is smaller then 20MB probably incompletely copied!
fa: متاسفيم فايل ان‌اف‌آي كوچكتر از20مگ ‌است !احتمالا درست كپي نشده

source: Press OK now for flashing %s Box will reboot automatically when finished!
fa: براي فلش كردن اوكي را حالا بزنيد %s پس از پايان دستگاه خودبه‌خود ريست ميشود

source: Sorry, currently not supported on the dm7025
fa: ساپورت نميشود dm7025 متاسفانه فعلا

source: direct Flashing Plugin by gutemine Version %s
fa: %s پلاگين فلاش مستقيم نويسنده گتماين نسخه

source: Backup
fa: پشتيبان

source: Press OK for starting backup to %s.nfi Be patient, this takes 3-5min ...
fa: دكمه اوكي را براي پشتيان‌گيري فشاردهيد در %s.nfi ...صبور باشيد. 3-5 دقيقه زمان ميبرد

source: Swap activation failed
fa: انجام نشد Swap فعالسازي
